//в этом файле будем организовывать авторизованный доступ пользователя к блогу

const { sessions } = require('../../sessions')
// снова импортируем объект с пользовательскими сессиями из файла sessions.js (обрати внимание на путь к файлу)


const checkAuth = (request, response, next) => {
    const sidFromUser = request.cookies.sid
    //получили идентификатор сессии от пользователя

    if (sessions[sidFromUser]) {
        return next()
        //пропускаем пользователя дальше
    }

    response.redirect('/auth/signin')
    // если пользователя в сессии нет, то отправляем его на авторизацию
}
// условие в if выполнится, если пользователь есть в объекте пользовательсих сессий
// если такого ключа в объекте нет, то будет undef = false 

module.exports = {
    checkAuth,
}
//экспортируем объект, дял импорта в блоге